chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/tmr/processor/tmr_p32mz1024efg064.h
PLIB_INLINE SFR_DATA _TMR_CLOCK_SOURCE_SYNC_INVERTED_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TSYNC_LENGTH;
        case TMR_ID_2 :
            return (SFR_DATA)-1;
        case TMR_ID_4 :
            return (SFR_DATA)-1;
        case TMR_ID_6 :
            return (SFR_DATA)-1;
        case TMR_ID_8 :
            return (SFR_DATA)-1;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_CLOCK_SOURCE_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return _T1CON_TCS_LENGTH;
        case TMR_ID_2 :
            return _T2CON_TCS_LENGTH;
        case TMR_ID_4 :
            return _T4CON_TCS_LENGTH;
        case TMR_ID_6 :
            return _T6CON_TCS_LENGTH;
        case TMR_ID_8 :
            return _T8CON_TCS_LENGTH;
        case TMR_ID_3 :
            return _T3CON_TCS_LENGTH;
        case TMR_ID_5 :
            return _T5CON_TCS_LENGTH;
        case TMR_ID_7 :
            return _T7CON_TCS_LENGTH;
        case TMR_ID_9 :
            return _T9CON_TCS_LENGTH;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_PERIOD_REGISTER_16BIT_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_2 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_4 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_6 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_8 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_3 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_5 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_7 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_9 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_PERIOD_MATCH_MODE_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_2 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_4 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_6 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_8 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_3 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_5 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_7 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_9 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_VALUE_REGISTER_16BIT_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_2 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_4 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_6 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_8 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_3 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_5 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_7 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_9 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_MODE_16BIT_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return _T2CON_T32_LENGTH;
        case TMR_ID_4 :
            return _T4CON_T32_LENGTH;
        case TMR_ID_6 :
            return _T6CON_T32_LENGTH;
        case TMR_ID_8 :
            return _T8CON_T32_LENGTH;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_MODE_32BIT_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return _T2CON_T32_LENGTH;
        case TMR_ID_4 :
            return _T4CON_T32_LENGTH;
        case TMR_ID_6 :
            return _T6CON_T32_LENGTH;
        case TMR_ID_8 :
            return _T8CON_T32_LENGTH;
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_PERIOD_REGISTER_16BIT_LOW_32_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_4 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_6 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_8 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _TMR_VALUE_REGISTER_16BIT_LOW_LEN(TMR_MODULE_ID i)
{
    switch (i) {
        case TMR_ID_1 :
            return (SFR_DATA)-1;
        case TMR_ID_2 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_4 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_6 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_8 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case TMR_ID_3 :
            return (SFR_DATA)-1;
        case TMR_ID_5 :
            return (SFR_DATA)-1;
        case TMR_ID_7 :
            return (SFR_DATA)-1;
        case TMR_ID_9 :
            return (SFR_DATA)-1;
        case TMR_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

